# Pandas

In [1]:
import pandas as pd

In [2]:
# series
values_array = [x for x in range(10, 51, 10)]
print(values_array)

[10, 20, 30, 40, 50]

In [3]:
series_values_array = pd.Series(values_array)
print(series_values_array)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
series_english_keys = pd.Series(values_array, index=['a','b','c','d','e'])
print(series_english_keys)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
series_english_keys.loc['a']

np.int64(10)

In [13]:
# dataframe
df = pd.DataFrame({
	'name': ['Marlon', 'Melanie', 'Ruby'],
	'age': ['30', '29', '2'],
	'job': ['Engineer', 'Teacher',  'Dog']
})

In [14]:
df.set_index('name', inplace=True)
df

        age       job
name
Marlon   30  Engineer
Melanie  29   Teacher
Ruby      2       Dog

In [15]:
df.loc['Marlon']

age          30
job    Engineer
Name: Marlon, dtype: object

In [19]:
df_one = pd.DataFrame({
	'a': [1,2,3,4]
}, index=[0,1,2,3])

df_two = pd.DataFrame({
	'a': [x for x in range(11, 15)]
}, index=[3,0,2,1])

df_one + df_two

    a
0  13
1  16
2  16
3  15

In [25]:
df.reset_index()

   level_0  index     name age       job
0        0      0   Marlon  30  Engineer
1        1      1  Melanie  29   Teacher
2        2      2     Ruby   2       Dog

In [29]:
df.to_csv('test.csv', index=None)

In [30]:
pd.read_csv('test.csv', index_col=0)

          name  age       job
index
0       Marlon   30  Engineer
1      Melanie   29   Teacher
2         Ruby    2       Dog

In [31]:
df.to_json('test.json')

In [32]:
df.to_dict()

{'index': {0: 0, 1: 1, 2: 2},
 'name': {0: 'Marlon', 1: 'Melanie', 2: 'Ruby'},
 'age': {0: '30', 1: '29', 2: '2'},
 'job': {0: 'Engineer', 1: 'Teacher', 2: 'Dog'}}